tutorials/mesh/moveDynamicMesh/rotorDisk_inclined/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    movingZoneFaces;
        type    faceSet;
        action  new;
        source  cylinderToFace;
        point1  (0 -0.06 0); // start point on cylinder axis
        point2  (0  0.06 0);   // end point on cylinder axis
        radius  0.5;
    }
    {
        name    movingZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        faceSet movingZoneFaces;
    }
);

// ************************************************************************* //
